"""Дана вещественная матрица А(3,4).Составить программу подсчета количества элементов матрицы,удовлетворяющих условию р1<=a(i,j)<=p2."""Matrix = [[1, 9, 3],          [5, 8, 10],          [22, 30, 44],          [100, 200, 300]]p1 = int(input('искать числа от:'))p2 = int(input('искать числа до:'))count = 0for num in Matrix:    for i in num:        if p1<=i<=p2:            count += 1print(count,'элементов матрицы,удовлетворяющих условию "р1<=a(i,j)<=p2"')